Repository: python/python-docs-ro
Catalog: tutorial/controlflow.po
Languages: ro

source: In a function call, keyword arguments must follow positional arguments. All the keyword arguments passed must match one of the arguments accepted by the function (e.g. ``actor`` is not a valid argument for the ``parrot`` function), and their order is not important. This also includes non-optional arguments (e.g. ``parrot(voltage=1000)`` is valid too). No argument may receive a value more than once. Here's an example that fails due to this restriction::
ro: Într-un apel de funcție, argumentele cuvânt-cheie le urmează argumentelor poziționale. Orice argument cuvânt-cheie trebuie să-i corespundă unuia din argumentele acceptate de funcție (de exemplu, ``actor`` nu este un argument valid pentru funcția ``papagal``), ordinea acestor argumente nefiind importantă. Cerința privește și argumentele neopționale (astfel, ``papagal(voltaj=1000)`` este o exprimare validă). Niciunui argument nu îi va fi atribuită valoarea de mai multe ori. Iată un exemplu de formulare neacceptată din cauza acestei restricții::

source: >>> def function(a): ... pass ... >>> function(0, a=0) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: function() got multiple values for argument 'a'
ro: >>> def funcție(a): ... pass ... >>> funcție(0, a=0) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: funcție() got multiple values for argument 'a'

source: When a final formal parameter of the form ``**name`` is present, it receives a dictionary (see :ref:`typesmapping`) containing all keyword arguments except for those corresponding to a formal parameter. This may be combined with a formal parameter of the form ``*name`` (described in the next subsection) which receives a :ref:`tuple <tut-tuples>` containing the positional arguments beyond the formal parameter list. (``*name`` must occur before ``**name``.) For example, if we define a function like this::
ro: Atunci când parametrul formal final este de forma ``**nume``, lui i se va atribui un dicționar (vezi :ref:`typesmapping`) care să cuprindă toate argumentele cuvânt-cheie cu excepția celor corespunzând unui parametru formal. Acest fapt poate fi combinat cu un parametru formal exprimat ca ``*nume`` (care va fi descris în subsecțiunea următoare) și căruia i se atribuie un :ref:`tuplu <tut-tuples>` ce conține toate argumentele poziționale de după lista parametrilor formali (``*nume`` trebuie să apară înaintea lui ``**nume``.) De exemplu, să definim o funcție astfel::

source: def cheeseshop(kind, *arguments, **keywords): print("-- Do you have any", kind, "?") print("-- I'm sorry, we're all out of", kind) for arg in arguments: print(arg) print("-" * 40) for kw in keywords: print(kw, ":", keywords[kw])
ro: def magazin_de_brânzeturi(fel, *argumente, **cuvinte_cheie): print("-- Aveți cumva", fel, "?") print("-- Scuze, am rămas fără", fel) for arg in argumente: print(arg) print("-" * 40) for cvc in cuvinte_cheie: print(cvc, ":", cuvinte_cheie[cvc])

source: It could be called like this::
ro: Funcția poate fi apelată astfel::

source: cheeseshop("Limburger", "It's very runny, sir.", "It's really very, VERY runny, sir.", shopkeeper="Michael Palin", client="John Cleese", sketch="Cheese Shop Sketch")
ro: magazin_de_brânzeturi("Limburger", "E tare apoasă, domnule.", "Realmente, e tare, TARE apoasă, domnule.", proprietar="Michael Palin", client="John Cleese", scheci="Cheese Shop Sketch")

source: and of course it would print:
ro: și, firește, va afișa:

source: -- Do you have any Limburger ? -- I'm sorry, we're all out of Limburger It's very runny, sir. It's really very, VERY runny, sir. ---------------------------------------- shopkeeper : Michael Palin client : John Cleese sketch : Cheese Shop Sketch
ro: -- Aveți cumva Limburger ? -- Scuze, am rămas fără Limburger E tare apoasă, domnule. Realmente, e tare, TARE apoasă, domnule. ---------------------------------------- proprietar : Michael Palin client : John Cleese scheci : Cheese Shop Sketch

source: Note that the order in which the keyword arguments are printed is guaranteed to match the order in which they were provided in the function call.
ro: Remarcați că ordinea în care argumentele cuvânt-cheie sunt afișate este garantată ca urmând ordinea în care aceste argumente cuvânt-cheie au fost inserate în apelul funcției.

source: Special parameters
ro: Parametri speciali

source: By default, arguments may be passed to a Python function either by position or explicitly by keyword. For readability and performance, it makes sense to restrict the way arguments can be passed so that a developer need only look at the function definition to determine if items are passed by position, by position or keyword, or by keyword.
ro: Tipic, argumentele i se transmit unei funcții în Python fie prin poziție fie prin cuvinte-cheie date în mod explicit. Din motive de lizibilitate și performanță, modurile de transmitere a argumentelor au fost restrânse astfel încât unui dezvoltator de cod să-i fie suficient să se uite la definiția unei funcții pentru a ști dacă un argument trebuie transmis numai prin poziție, prin poziție sau prin cuvânt-cheie ori numai prin cuvânt-cheie.

source: A function definition may look like:
ro: Definiția unei funcții poate arăta ca aici:

source: def f(pos1, pos2, /, pos_or_kwd, *, kwd1, kwd2): ----------- ---------- ---------- | | | | Positional or keyword | | - Keyword only -- Positional only
ro: def f(poz1, poz2, /, poz_sau_cvc, *, cvc1, cvc2): ---------- ----------- ---------- | | | | Pozițional | | sau | | cuvânt-cheie | | - Numai cuvânt-cheie -- Numai pozițional

source: where ``/`` and ``*`` are optional. If used, these symbols indicate the kind of parameter by how the arguments may be passed to the function: positional-only, positional-or-keyword, and keyword-only. Keyword parameters are also referred to as named parameters.
ro: unde ``/`` și ``*`` sunt opționale. Dacă le folosiți, atunci aceste simboluri vor indica tipul de parametru prin chiar modul cum le sunt transmise argumentele funcției: numai pozițional, pozițional-sau-cuvânt-cheie ori numai cuvânt-cheie. Despre parametrii cuvânt-cheie spunem că sunt și parametri-cu-nume.

source: Positional-or-Keyword Arguments
ro: Argumente pozițional-sau-cuvânt-cheie

source: If ``/`` and ``*`` are not present in the function definition, arguments may be passed to a function by position or by keyword.
ro: Dacă nici ``/``, nici ``*`` nu sunt prezente în definiția funcției, atunci argumentele îi pot fi transmise acesteia atât prin poziție cât și prin cuvinte-cheie.

source: Positional-Only Parameters
ro: Parametri numai poziționali

source: Looking at this in a bit more detail, it is possible to mark certain parameters as *positional-only*. If *positional-only*, the parameters' order matters, and the parameters cannot be passed by keyword. Positional-only parameters are placed before a ``/`` (forward-slash). The ``/`` is used to logically separate the positional-only parameters from the rest of the parameters. If there is no ``/`` in the function definition, there are no positional-only parameters.
ro: Intrând puțin în detalii, să observăm că este posibil să marcăm anumiți parametri cu *numai pozițional*. Atunci când aceștia sunt *numai poziționali*, ordinea parametrilor contează și parametrii nu pot fi transmiși prin cuvinte-cheie. Parametrii numai poziționali sunt plasați înaintea lui ``/`` (bara oblică). ``/``-ul este folosit pentru a separa din punct de vedere logic parametrii numai poziționali de restul parametrilor. Dacă nu există niciun ``/`` în definiția funcției, atunci nu există nici parametri numai poziționali ai acesteia.

source: Parameters following the ``/`` may be *positional-or-keyword* or *keyword-only*.
ro: Parametrii care îi urmează lui ``/`` pot fi *poziționali-sau-cuvinte-cheie* ori *numai cuvinte-cheie*.

source: Keyword-Only Arguments
ro: Argumente numai cuvinte-cheie

source: To mark parameters as *keyword-only*, indicating the parameters must be passed by keyword argument, place an ``*`` in the arguments list just before the first *keyword-only* parameter.
ro: Ca să marcăm parametrii cu *numai cuvânt-cheie*, adică să indicăm că acești parametri trebuie transmiși prin argumente cuvinte-cheie, vom plasa un ``*`` în lista argumentelor, chiar înainte de primul parametru *numai cuvânt-cheie*.

source: Function Examples
ro: Exemple de funcții

source: Consider the following example function definitions paying close attention to the markers ``/`` and ``*``::
ro: Să luăm în considerare următoarele definiții de funcții demonstrative, cu grijă la marcajele ``/`` și ``*``::

source: >>> def standard_arg(arg): ... print(arg) ... >>> def pos_only_arg(arg, /): ... print(arg) ... >>> def kwd_only_arg(*, arg): ... print(arg) ... >>> def combined_example(pos_only, /, standard, *, kwd_only): ... print(pos_only, standard, kwd_only)
ro: >>> def argumente_uzuale(arg): ... print(arg) ... >>> def argumente_numai_poziționale(arg, /): ... print(arg) ... >>> def argumente_numai_cuvinte_cheie(*, arg): ... print(arg) ... >>> def exemplu_de_combinații(numai_poz, /, tipice, *, numai_cvc): ... print(numai_poz, tipice, numai_cvc)

source: The first function definition, ``standard_arg``, the most familiar form, places no restrictions on the calling convention and arguments may be passed by position or keyword::
ro: Prima definiție de funcție, ``argumente_uzuale``, cu forma cea mai des întâlnită, nu impune nicio restricție asupra felului în care o apelăm pe aceasta iar argumentele funcției pot fi transmise atât prin poziție cât și prin cuvânte-cheie::

source: >>> standard_arg(2) 2 >>> standard_arg(arg=2) 2
ro: >>> argumente_uzuale(2) 2 >>> argumente_uzuale(arg=2) 2

source: The second function ``pos_only_arg`` is restricted to only use positional parameters as there is a ``/`` in the function definition::
ro: Cea de-a doua funcție, ``argumente_numai_poziționale``, este restrânsă la utilizarea doar a parametrilor numai poziționali deoarece în definiția funcției apare un ``/``::

source: >>> pos_only_arg(1) 1 >>> pos_only_arg(arg=1) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: pos_only_arg() got some positional-only arguments passed as keyword arguments: 'arg'
ro: >>> argumente_numai_poziționale(1) 1 >>> argumente_numai_poziționale(arg=1) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: argumente_numai_poziționale() got some positional-only arguments passed as keyword arguments: 'arg'

source: The third function ``kwd_only_arg`` only allows keyword arguments as indicated by a ``*`` in the function definition::
ro: A treia funcție, ``argumente_numai_cuvinte_cheie``, permite doar argumente cuvinte-cheie, după cum ne indică acel ``*`` din definiția funcției::

source: >>> kwd_only_arg(3) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: kwd_only_arg() takes 0 positional arguments but 1 was given >>> kwd_only_arg(arg=3) 3
ro: >>> argumente_numai_cuvinte_cheie(3) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: argumente_numai_cuvinte_cheie() takes 0 positional arguments but 1 was given >>> argumente_numai_cuvinte_cheie(arg=3) 3

source: And the last uses all three calling conventions in the same function definition::
ro: Iar ultimul exemplu întrebuințează toate cele trei convenții de apel în aceeași definiție de funcție::

source: >>> combined_example(1, 2, 3) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: combined_example() takes 2 positional arguments but 3 were given >>> combined_example(1, 2, kwd_only=3) 1 2 3 >>> combined_example(1, standard=2, kwd_only=3) 1 2 3 >>> combined_example(pos_only=1, standard=2, kwd_only=3) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: combined_example() got some positional-only arguments passed as keyword arguments: 'pos_only'
ro: >>> exemplu_de_combinații(1, 2, 3) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: exemplu_de_combinații() takes 2 positional arguments but 3 were given >>> exemplu_de_combinații(1, 2, numai_cvc=3) 1 2 3 >>> exemplu_de_combinații(1, tipice=2, numai_cvc=3) 1 2 3 >>> exemplu_de_combinații(numai_poz=1, tipice=2, numai_cvc=3) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: exemplu_de_combinații() got some positional-only arguments passed as keyword arguments: 'pos_only'

source: Finally, consider this function definition which has a potential collision between the positional argument ``name`` and ``**kwds`` which has ``name`` as a key::
ro: În sfârșit, să considerăm o definiție de funcție care poate provoca o coliziune de nume între argumentul pozițional ``nume`` și argumentul ``**cuvinte-cheie`` atunci când acesta din urmă va include ``nume`` pe post de cheie::

source: def foo(name, **kwds): return 'name' in kwds
ro: def foo(nume, **cuvinte_cheie): return 'nume' in cuvinte_cheie

source: There is no possible call that will make it return ``True`` as the keyword ``'name'`` will always bind to the first parameter. For example::
ro: Nu putem realiza niciun apel al funcției care să întoarcă ``True`` deoarece cuvântul-cheie ``'nume'`` se va lega întotdeauna la primul parametru. De exemplu::

source: >>> foo(1, **{'name': 2}) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: foo() got multiple values for argument 'name' >>>
ro: >>> foo(1, **{'nume': 2}) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: foo() got multiple values for argument 'nume' >>>

source: But using ``/`` (positional only arguments), it is possible since it allows ``name`` as a positional argument and ``'name'`` as a key in the keyword arguments::
ro: Însă, folosind ``/`` (plasat după argumentele numai poziționale), un asemenea apel este posibil deoarece acum putem distinge între ``nume`` ca parametru numai pozițional și cheia ``'nume'`` a unui argument cuvânt-cheie::

source: >>> def foo(name, /, **kwds): ... return 'name' in kwds ... >>> foo(1, **{'name': 2}) True
ro: >>> def foo(nume, /, **cuvinte_cheie): ... return 'nume' in cuvinte_cheie ... >>> foo(1, **{'nume': 2}) True

source: In other words, the names of positional-only parameters can be used in ``**kwds`` without ambiguity.
ro: Altfel spus, numele parametrilor numai poziționali vor putea fi folosite în ``**cuvinte_cheie`` fără nicio ambiguitate.

source: Recap
ro: De reținut

source: The use case will determine which parameters to use in the function definition::
ro: Modul de întrebuințare determină ce parametri să folosim la definiția unei funcții::

source: def f(pos1, pos2, /, pos_or_kwd, *, kwd1, kwd2):
ro: def f(poz1, poz2, /, poz_sau_cvc, *, cvc1, cvc2):

source: As guidance:
ro: Recomandări:

source: Use positional-only if you want the name of the parameters to not be available to the user. This is useful when parameter names have no real meaning, if you want to enforce the order of the arguments when the function is called or if you need to take some positional parameters and arbitrary keywords.
ro: Folosiți argumente numai poziționale dacă doriți ca numele parametrilor să nu le fie accesibile utilizatorului. Această întrebuințare ne este de folos atunci când numele parametrilor nu au nicio semnificație pentru program, atunci când dorim să impunem o anumită ordine a argumentelor la apelul funcției sau atunci când este nevoie să utilizăm câțiva parametri numai poziționali alături de niște cuvinte cheie arbitrare.

source: Use keyword-only when names have meaning and the function definition is more understandable by being explicit with names or you want to prevent users relying on the position of the argument being passed.
ro: Folosiți argumente numai cuvinte-cheie atunci când numele au semnificație pentru program iar definiția funcției se va înțelege mai ușor dacă conține nume ori atunci când doriți să-i împiedicați pe utilizatori să se bazeze pe pozițiile argumentelor ce trebuie transmise.

source: For an API, use positional-only to prevent breaking API changes if the parameter's name is modified in the future.
ro: În cazul unui API, folosiți argumente numai poziționale pentru a evita funcționarea defectuoasă a viitoarelor transformări ale API-ului atunci când numele vreunui parametru va fi modificat.

source: Arbitrary Argument Lists
ro: Liste arbitrare de argumente

source: Finally, the least frequently used option is to specify that a function can be called with an arbitrary number of arguments. These arguments will be wrapped up in a tuple (see :ref:`tut-tuples`). Before the variable number of arguments, zero or more normal arguments may occur. ::
ro: La final, cea mai puțin utilizată variantă de definiție este cea în care precizăm că o funcție poate fi apelată cu un număr variabil de argumente. Aceste argumente vor fi încadrate într-un tuplu (vezi :ref:`tut-tuples`).

source: def write_multiple_items(file, separator, *args): file.write(separator.join(args))
ro: def înscrie_mai_mulți_itemi(fișier, despărțitor, *argumente): fișier.write(despărțitor.join(argumente))

source: Normally, these *variadic* arguments will be last in the list of formal parameters, because they scoop up all remaining input arguments that are passed to the function. Any formal parameters which occur after the ``*args`` parameter are 'keyword-only' arguments, meaning that they can only be used as keywords rather than positional arguments. ::
ro: După cum e de așteptat, aceste argumente *variadice* vor fi așezate la sfârșitul listei de parametri formali, dat fiind că ele vor cuprinde tot restul datelor de intrare care trebuie transmise funcției. Acei parametri formali care sunt poziționați după parametrul ``*argumente`` sunt argumente 'numai cuvânt-cheie', ceea ce înseamnă că vor putea fi folosiți doar pe post de cuvinte-cheie și nu ca argumente poziționale. ::

source: >>> def concat(*args, sep="/"): ... return sep.join(args) ... >>> concat("earth", "mars", "venus") 'earth/mars/venus' >>> concat("earth", "mars", "venus", sep=".") 'earth.mars.venus'
ro: >>> def concatenează(*argumente, despărțitor="/"): ... return despărțitor.join(argumente) ... >>> concatenează("Pământ", "Marte", "Venus") 'Pământ/Marte/Venus' >>> concatenează("Pământ", "Marte", "Venus", despărțitor=".") 'Pământ.Marte.Venus'

source: Unpacking Argument Lists
ro: Despachetarea listelor de argumente

source: The reverse situation occurs when the arguments are already in a list or tuple but need to be unpacked for a function call requiring separate positional arguments. For instance, the built-in :func:`range` function expects separate *start* and *stop* arguments. If they are not available separately, write the function call with the ``*``\ -operator to unpack the arguments out of a list or tuple::
ro: Situația inversă va fi întâlnită atunci când argumentele care ne interesează ne vor fi date sub formă fie de listă, fie de tuplu și va trebui să le despachetăm pentru a fi folosite într-un apel de funcție care necesită argumente poziționale introduse separat. De exemplu, funcția predefinită :func:`range` necesită argumente *start* și *stop* transmise separat. Dacă acestea nu sunt disponibile separat, atunci vom înscrie în apelul funcției operatorul ``*`` pentru a despacheta argumentele fie din listă fie din tuplu::

source: >>> list(range(3, 6)) # normal call with separate arguments [3, 4, 5] >>> args = [3, 6] >>> list(range(*args)) # call with arguments unpacked from a list [3, 4, 5]
ro: >>> list(range(3, 6)) # apel tipic, cu argumente date separat [3, 4, 5] >>> argumente = [3, 6] >>> list(range(*argumente)) # apel cu argumente despachetate dintr-o listă [3, 4, 5]

source: In the same fashion, dictionaries can deliver keyword arguments with the ``**``\ -operator::
ro: La fel, dicționarele de date pot transmite argumente cuvinte-cheie cu ajutorul operatorului ``**``::

source: >>> def parrot(voltage, state='a stiff', action='voom'): ... print("-- This parrot wouldn't", action, end=' ') ... print("if you put", voltage, "volts through it.", end=' ') ... print("E's", state, "!") ... >>> d = {"voltage": "four million", "state": "bleedin' demised", "action": "VOOM"} >>> parrot(**d) -- This parrot wouldn't VOOM if you put four million volts through it. E's bleedin' demised !
ro: >>> def papagal(voltaj, stare='țeapăn', acțiune='fâl-fâl'): ... print("-- Papagalul acesta n-are cum să", acțiune, end=' ') ... print("dacă băgați", voltaj, "de volți în el.", end=' ') ... print("Zău că-i", stare, "!") ... >>> d = {"voltaj": "patru milioane", "stare": "al naibii de dus", "acțiune": "FÂL-FÂL"} >>> papagal(**d) -- Papagalul acesta n-are cum să FÂL-FÂL dacă băgați patru milioane de volți în el. Zău că-i al naibii de dus !

source: Lambda Expressions
ro: Expresii lambda

source: Small anonymous functions can be created with the :keyword:`lambda` keyword. This function returns the sum of its two arguments: ``lambda a, b: a+b``. Lambda functions can be used wherever function objects are required. They are syntactically restricted to a single expression. Semantically, they are just syntactic sugar for a normal function definition. Like nested function definitions, lambda functions can reference variables from the containing scope::
ro: Funcții anonime, cu cod de dimensiuni reduse, pot fi create folosind cuvântul-cheie :keyword:`lambda`. Funcția care urmează va returna suma celor două argumente ale ei: ``lambda a, b: a+b``. Funcțiile lambda pot fi utilizate oriunde se cer obiecte funcție. Ele sunt restrânse dpdv. sintactic la o singură expresie. Dpdv. semantic, ele sunt doar zahăr sintactic pudrat peste o definiție obișnuită de funcție. Aidoma definițiilor imbricate de funcții, funcțiile lambda pot face referire la variabile dintr-un domeniu de valabilitate care include definițiile funcțiilor lambda în cauză::

source: >>> def make_incrementor(n): ... return lambda x: x + n ... >>> f = make_incrementor(42) >>> f(0) 42 >>> f(1) 43
ro: >>> def construiește_un_incrementor(n): ... return lambda x: x + n ... >>> f = construiește_un_incrementor(42) >>> f(0) 42 >>> f(1) 43

source: The above example uses a lambda expression to return a function. Another use is to pass a small function as an argument. For instance, :meth:`list.sort` takes a sorting key function *key* which can be a lambda function::
ro: Exemplul de deasupra întrebuințează o expresie lambda pentru a returna o funcție. Altă utilizare este dată de transmiterea unei funcții cu cod redus pe post de argument. Astfel, :meth:`list.sort` folosește ca valoare a cheii *key* o funcție de sortare iar aceasta poate fi inclusiv o funcție lambda::

source: >>> pairs = [(1, 'one'), (2, 'two'), (3, 'three'), (4, 'four')] >>> pairs.sort(key=lambda pair: pair[1]) >>> pairs [(4, 'four'), (1, 'one'), (3, 'three'), (2, 'two')]
ro: >>> perechi = [(1, 'unu'), (2, 'doi'), (3, 'trei'), (4, 'patru')] >>> perechi.sort(key=lambda pereche: pereche[1]) >>> perechi [(2, 'doi'), (4, 'patru'), (3, 'trei'), (1, 'unu')]

source: Documentation Strings
ro: Șiruri de documentație

source: Here are some conventions about the content and formatting of documentation strings.
ro: Iată câteva convenții privind conținutul și formatul șirurilor de documentație (în englezește, ca jargon, *docstring*).
