Repository: python/python-docs-ro
Catalog: tutorial/controlflow.po
Languages: ro

source: The first line should always be a short, concise summary of the object's purpose. For brevity, it should not explicitly state the object's name or type, since these are available by other means (except if the name happens to be a verb describing a function's operation). This line should begin with a capital letter and end with a period.
ro: Primul rând trebuie să fie întotdeauna un sumar restrâns, concis al scopului pe care îl are obiectul în cauză. Pentru concizie, el nu trebuie să menționeze nici numele și nici tipul obiectului, dat fiind că acestea vor putea fi aflate prin alte mijloace (excepție face cazul când numele este chiar verbul care descrie modul de operare al funcției). Ar fi bine ca acest rând să înceapă cu o majusculă și să se încheie cu punct.

source: If there are more lines in the documentation string, the second line should be blank, visually separating the summary from the rest of the description. The following lines should be one or more paragraphs describing the object's calling conventions, its side effects, etc.
ro: Dacă șirul de documentație conține mai multe rânduri, atunci cel de-al doilea rând este bine să fie gol, separând vizual sumarul de restul descrierii. Rândurile care urmează, în șirul de documentație, ar trebui grupate într-unul sau mai multe paragrafe referitoare la convențiile de apel ale obiectului, la diversele complicații date de utilizarea sa șamd.

source: The Python parser does not strip indentation from multi-line string literals in Python, so tools that process documentation have to strip indentation if desired. This is done using the following convention. The first non-blank line *after* the first line of the string determines the amount of indentation for the entire documentation string. (We can't use the first line since it is generally adjacent to the string's opening quotes so its indentation is not apparent in the string literal.) Whitespace "equivalent" to this indentation is then stripped from the start of all lines of the string. Lines that are indented less should not occur, but if they occur all their leading whitespace should be stripped. Equivalence of whitespace should be tested after expansion of tabs (to 8 spaces, normally).
ro: Parserul Python-ului nu elimină indentația dintr-o dată literală de tip șir de caractere care se întinde pe mai multe rânduri de program Python, așa că uneltele informatice care vor procesa documentația trebuie să elimine ele-însele indentația, dacă acest lucru este dorit. Eliminarea se pregătește folosind următoarea convenție. Primul rând care nu este gol *de după* primul rând al datei literale va determina lățimea indentației pentru întregul șir de documentație. (Nu putem întrebuința în această privință primul rând deoarece el este adiacent, în general, ghilimelor din deschiderea șirului astfel că indentația acestui rând nu se observă în cuprinsul șirului literal.) Un spațiu gol "echivalent" cu lățimea acestei indentații va fi eliminat de la începutul tuturor rândurilor datei literale. Rânduri care să fie indentate cu o indentație mai scurtă nu ar trebui să existe în șirul de documentație, dar dacă există, atunci întregul spațiu gol de la începutul lor este bine să fie eliminat. Lățimea spațiului gol trebuie testată folosind expansiunea tabulatorului (de 8 spații, în mod normal).

source: Here is an example of a multi-line docstring::
ro: Iată un exemplu de docstring pe mai multe rânduri::

source: >>> def my_function(): ... """Do nothing, but document it. ... ... No, really, it doesn't do anything. ... """ ... pass ... >>> print(my_function.__doc__) Do nothing, but document it. No, really, it doesn't do anything.
ro: >>> def funcția_mea(): ... """Nu face nimica, dar precizează asta. ... ... Zău, realmente, nu face nimica. ... """ ... pass ... >>> print(funcția_mea.__doc__) Nu face nimica, dar precizează asta. Zău, realmente, nu face nimica.

source: Function Annotations
ro: Adnotarea funcțiilor

source: :ref:`Function annotations <function>` are completely optional metadata information about the types used by user-defined functions (see :pep:`3107` and :pep:`484` for more information).
ro: :ref:`Adnotarea funcțiilor <function>` reprezintă informația opțională, de meta-date, care se referă la tipurile datelor întrebuințate de către funcțiile definite de utilizator (vezi :pep:`3107` și :pep:`484` pentru mai multe detalii).

source: :term:`Annotations <function annotation>` are stored in the :attr:`!__annotations__` attribute of the function as a dictionary and have no effect on any other part of the function. Parameter annotations are defined by a colon after the parameter name, followed by an expression evaluating to the value of the annotation. Return annotations are defined by a literal ``->``, followed by an expression, between the parameter list and the colon denoting the end of the :keyword:`def` statement. The following example has a required argument, an optional argument, and the return value annotated::
ro: :term:`Adnotările <function annotation>` sunt memorate în atributul :attr:`!__annotations__` al funcției sub formă de dicționar de date și nu au niciun efect asupra celorlalte componente ale funcției. Adnotările parametrilor se marchează prin două puncte așezate după numele parametrului, semnul de punctuație fiind urmat de o expresie a cărei evaluare va da valoarea adnotării. Adnotarea mărimilor returnate de funcție se definește prin ansamblul dat de constanta literală ``->`` urmată de o expresie de evaluat, ansamblu ce va fi poziționat între lista parametrilor funcției și semnul de punctuație două puncte ce denotă finalul instrucțiunii :keyword:`def`.

source: >>> def f(ham: str, eggs: str = 'eggs') -> str: ... print("Annotations:", f.__annotations__) ... print("Arguments:", ham, eggs) ... return ham + ' and ' + eggs ... >>> f('spam') Annotations: {'ham': <class 'str'>, 'return': <class 'str'>, 'eggs': <class 'str'>} Arguments: spam eggs 'spam and eggs'
ro: >>> def f(șuncă: str, ouă: str = 'ouă') -> str: ... print("Adnotări:", f.__annotations__) ... print("Argumente:", șuncă, ouă) ... return șuncă + ' și ' + ouă ... >>> f('carne presată') Adnotări: {'șuncă': <class 'str'>, 'return': <class 'str'>, 'ouă': <class 'str'>} Argumente: carne presată ouă 'carne presată și ouă'

source: Intermezzo: Coding Style
ro: Intermezzo: stilul în care scriem cod

source: Now that you are about to write longer, more complex pieces of Python, it is a good time to talk about *coding style*. Most languages can be written (or more concise, *formatted*) in different styles; some are more readable than others. Making it easy for others to read your code is always a good idea, and adopting a nice coding style helps tremendously for that.
ro: Acum, când puteți începe să scrieți fragmente mai lungi și mai complexe de programe în Python, este momentul potrivit să discutăm despre *stilul de scris cod*. Majoritatea limbajelor permite redactarea (ori, mai pe scurt, *formatarea*) în stiluri diferite; unele sunt mai lizibile ca altele. A ușura citirea de către alții a codului dumneavoastră este întotdeauna o idee bună, iar adoptarea unui stil de scriere prezentabil se dovedește de mare ajutor în acest scop.

source: For Python, :pep:`8` has emerged as the style guide that most projects adhere to; it promotes a very readable and eye-pleasing coding style. Every Python developer should read it at some point; here are the most important points extracted for you:
ro: În cazul Python-ului, :pep:`8` s-a impus ca ghidul stilistic la care a aderat majoritatea proiectelor; acesta promovează un stil de scriere a codului ușor citibil și plăcut ochiului. Orice programator în Python ar trebui să îl citească la un moment dat; iată un extras al celor mai importante elemente:

source: Use 4-space indentation, and no tabs.
ro: Folosiți indentări de 4 spații goale, nu apelați la tabulator.

source: 4 spaces are a good compromise between small indentation (allows greater nesting depth) and large indentation (easier to read). Tabs introduce confusion, and are best left out.
ro: 4 spații goale constituie un compromis bun între indentarea îngustă (care permite imbricarea pe mai multe niveluri) și indentarea lată (mai ușor de citit).

source: Wrap lines so that they don't exceed 79 characters.
ro: Desfășurați rândurile de cod astfel încât ele să nu depășească 79 de caractere.

source: This helps users with small displays and makes it possible to have several code files side-by-side on larger displays.
ro: Aceasta le servește utilizatorilor cu terminale de dimensiuni mici și permite așezarea unul lângă celălalt a mai multor fișiere cu cod pe un ecran mai lat.

source: Use blank lines to separate functions and classes, and larger blocks of code inside functions.
ro: Folosiți rânduri goale pentru a separa funcțiile și clasele, precum și blocurile mai mari de cod din corpul funcțiilor.

source: When possible, put comments on a line of their own.
ro: Atunci când este posibil, plasați comentariile pe rânduri dedicate lor.

source: Use docstrings.
ro: Utilizați docstring-uri.

source: Use spaces around operators and after commas, but not directly inside bracketing constructs: ``a = f(1, 2) + g(3, 4)``.
ro: Inserați spații goale în jurul operatorilor și după virgule, dar nu și direct în constructele cu paranteze: ``a = f(1, 2) + g(3, 4)``.

source: Name your classes and functions consistently; the convention is to use ``UpperCamelCase`` for classes and ``lowercase_with_underscores`` for functions and methods. Always use ``self`` as the name for the first method argument (see :ref:`tut-firstclasses` for more on classes and methods).
ro: Denumiți-vă clasele și funcțiile într-un mod sistematic; convenția este de a folosi ``ScriereaCămilăCareÎncepeCuMajusculă`` pentru clase și ``litere_mici_despărțite_de_bara_jos`` pentru funcții și metode. Întrebuințați întotdeauna ``self`` pe post de nume pentru cel dintâi argument al unei metode (vezi :ref:`tut-firstclasses` pentru mai multe informații despre clase și metode).

source: Don't use fancy encodings if your code is meant to be used in international environments. Python's default, UTF-8, or even plain ASCII work best in any case.
ro: Nu utilizați codificări de caractere sofisticate dacă programul pe care îl scrieți este destinat utilizării în medii internaționale. Codificarea prestabilită a Python-ului, UTF-8, ori chiar și simpla codificare ASCII, funcționează de minune în aproape orice caz.

source: Likewise, don't use non-ASCII characters in identifiers if there is only the slightest chance people speaking a different language will read or maintain the code.
ro: De asemeni, nu întrebuințați caractere non-ASCII în identificatori dacă există o oricât de neînsemnată șansă ca persoane care nu vă vorbesc limba să aibă de citit ori de întreținut codul pe care îl scrieți.

source: Footnotes
ro: Note de subsol

source: Actually, *call by object reference* would be a better description, since if a mutable object is passed, the caller will see any changes the callee makes to it (items inserted into a list).
ro: De fapt, *apel prin referință la obiect* ar fi o descriere mai potrivită, dat fiind că, dacă transmitem un obiect mutabil, atunci apelantul va vedea orice modificare făcută de apelat (cum ar fi niște itemi noi inserați într-o listă).

source: statement
ro: instrucțiune

source: for
ro: pentru

source: documentation strings
ro: șiruri de documentație

source: docstrings
ro: docstring-uri

source: strings, documentation
ro: șiruri de caractere, documentație

source: * (asterisk)
ro: * (asterisc)

source: in function calls
ro: în apeluri de funcție

source: function
ro: funcție

source: annotations
ro: adnotări

source: function annotations
ro: adnotări de funcții

source: : (colon)
ro: : (două puncte)

source: coding
ro: scriere de cod

source: style
ro: stil
