Repository: python/python-docs-ro
Catalog: tutorial/controlflow.po
Languages: ro

source: A recommended way to read patterns is to look at them as an extended form of what you would put on the left of an assignment, to understand which variables would be set to what. Only the standalone names (like ``var`` above) are assigned to by a match statement. Dotted names (like ``foo.bar``), attribute names (the ``x=`` and ``y=`` above) or class names (recognized by the "(...)" next to them like ``Point`` above) are never assigned to.
ro: Atunci când citim un model este recomandat să-l privim ca pe forma extinsă a ceea ce se pune la stânga unei atribuiri, respectiv să înțelegem ce variabilă va fi setată la ce valoare. O instrucțiune match poate face atribuiri numai pentru numele de sine stătătoare (precum ``var``-ul de deasupra). Numelor-cu-punct (de la englezescul *dotted name*; ca, de exemplu, ``foo.bar``, o expresie intraductibilă, vedeți `foobar <https://en.wikipedia.org/wiki/Foobar>`_), numelor de atribute (``x=`` și ``y=`` de mai sus) ori numelor de clase (pe care le recunoaștem după "(...)"-ul așezat după ele, ca în cazul lui ``Punctul`` de deasupra) nu li se fac niciodată atribuiri.

source: Patterns can be arbitrarily nested. For example, if we have a short list of Points, with ``__match_args__`` added, we could match it like this::
ro: Modelele pot fi imbricate de câte ori dorim. De exemplu, dacă avem o listă scurtă de Puncte, căreia i-am adăugat ``__match_args__``, îi putem aplica un match astfel::

source: class Point: __match_args__ = ('x', 'y') def __init__(self, x, y): self.x = x self.y = y match points: case []: print("No points") case [Point(0, 0)]: print("The origin") case [Point(x, y)]: print(f"Single point {x}, {y}") case [Point(0, y1), Point(0, y2)]: print(f"Two on the Y axis at {y1}, {y2}") case _: print("Something else")
ro: class Punctul: __match_args__ = ('x', 'y') def __init__(self, x, y): self.x = x self.y = y match puncte: case []: print("Niciun punct") case [Punctul(0, 0)]: print("Originea") case [Punctul(x, y)]: print(f"Un singur punct {x}, {y}") case [Punctul(0, y1), Punctul(0, y2)]: print(f"Două puncte pe axa Y la {y1}, {y2}") case _: print("Altceva")

source: We can add an ``if`` clause to a pattern, known as a "guard". If the guard is false, ``match`` goes on to try the next case block. Note that value capture happens before the guard is evaluated::
ro: Îi putem adăuga o clauză ``if``, numită "gardă" (de la englezescul *guard*), unui model. Dacă valoarea logică a gărzii este fals, atunci ``match``-ul trece la următorul bloc case. Captarea valorilor, trebuie remarcat, se va petrece înainte de evaluarea gărzii::

source: match point: case Point(x, y) if x == y: print(f"Y=X at {x}") case Point(x, y): print(f"Not on the diagonal")
ro: match punct: case Punctul(x, y) if x == y: print(f"Y=X la {x}") case Punctul(x, y): print(f"Nu e pe diagonală")

source: Several other key features of this statement:
ro: Alte caracteristici-cheie ale acestei instrucțiuni:

source: Like unpacking assignments, tuple and list patterns have exactly the same meaning and actually match arbitrary sequences. An important exception is that they don't match iterators or strings.
ro: În calitate de atribuiri cu despachetare, tuplurile și modelele de liste au aceeași semnificație și reușesc să se potrivească unor secvențe arbitrare. O excepție importantă este aceea că ele nu fac potriviri pentru iteratori sau șiruri de caractere.

source: Sequence patterns support extended unpacking: ``[x, y, *rest]`` and ``(x, y, *rest)`` work similar to unpacking assignments. The name after ``*`` may also be ``_``, so ``(x, y, *_)`` matches a sequence of at least two items without binding the remaining items.
ro: Modelele de secvențe suportă despachetări extinse: ``[x, y, *restul]`` și ``(x, y, *restul)`` se comportă similar cu atribuirile cu despachetare. Numele de după ``*`` poate fi inclusiv ``_``, astfel că ``(x, y, *_)`` se va potrivi unei secvențe de cel puțin doi itemi fără a mai lega itemii rămași.

source: Mapping patterns: ``{"bandwidth": b, "latency": l}`` captures the ``"bandwidth"`` and ``"latency"`` values from a dictionary. Unlike sequence patterns, extra keys are ignored. An unpacking like ``**rest`` is also supported. (But ``**_`` would be redundant, so it is not allowed.)
ro: Modele de mapare: ``{"lățime_de_bandă": b, "latență": l}`` capturează valorile lui ``"lățime_de_bandă"`` și ``"latență"`` dintr-un dicționar. Spre deosebire de cazul modelelor de secvențe, cheile suplimentare vor fi ignorate. Este suportată și o despachetare de tipul ``**restul``. (Dat fiind că despachetarea ``**_`` ar fi redundantă, ea nu este permisă.)

source: Subpatterns may be captured using the ``as`` keyword::
ro: Submodelele pot fi capturate folosind cuvântul-cheie ``as``::

source: case (Point(x1, y1), Point(x2, y2) as p2): ...
ro: case (Punctul(x1, y1), Punctul(x2, y2) as p2): ...

source: will capture the second element of the input as ``p2`` (as long as the input is a sequence of two points)
ro: va captura cel de-al doilea element al inputului ca ``p2`` (numai dacă inputul este o secvență de două puncte)

source: Most literals are compared by equality, however the singletons ``True``, ``False`` and ``None`` are compared by identity.
ro: Majoritatea datelor literale sunt comparate folosind egalitatea, totuși valorile unice (de la englezescul *singleton*) ``True``, ``False`` și ``None`` se compară folosind identitatea.

source: Patterns may use named constants. These must be dotted names to prevent them from being interpreted as capture variable::
ro: Modelele pot folosi constante cu nume. Acestea trebuie să fie nume-cu-punct pentru a se evita interpretarea lor drept variabile de captare::

source: from enum import Enum class Color(Enum): RED = 'red' GREEN = 'green' BLUE = 'blue' color = Color(input("Enter your choice of 'red', 'blue' or 'green': ")) match color: case Color.RED: print("I see red!") case Color.GREEN: print("Grass is green") case Color.BLUE: print("I'm feeling the blues :(")
ro: from enum import Enum class Culoare(Enum): ROȘU = 'roșu' VERDE = 'verde' ALBASTRU = 'albastru' culoare = Culoare( \ input("Alegeți între 'roșu', 'albastru' sau 'verde': ")) match culoare: case Culoare.ROȘU: print("Văd roșu!") case Culoare.VERDE: print("Iarba este verde") case Culoare.ALBASTRU: print("Cântă-mi de inimă albastră :(")

source: For a more detailed explanation and additional examples, you can look into :pep:`636` which is written in a tutorial format.
ro: Pentru explicații detaliate și alte exemple, puteți răsfoi :pep:`636` care este redactat sub formă de tutorial.

source: Defining Functions
ro: Definirea funcțiilor

source: We can create a function that writes the Fibonacci series to an arbitrary boundary::
ro: Puteți construi o funcție care să scrie toți termenii șirului lui Fibonacci care sunt mici decât o valoare dată::

source: >>> def fib(n): # write Fibonacci series less than n ... """Print a Fibonacci series less than n.""" ... a, b = 0, 1 ... while a < n: ... print(a, end=' ') ... a, b = b, a+b ... print() ... >>> # Now call the function we just defined: >>> fib(2000) 0 1 1 2 3 5 8 13 21 34 55 89 144 233 377 610 987 1597
ro: >>> def fib(n): # scriem termenii șirului lui Fibonacci mai mici ca n ... """Afișez termenii șirului lui Fibonacci mai mici ca n.""" ... a, b = 0, 1 ... while a < n: ... print(a, end=' ') ... a, b = b, a+b ... print() ... >>> # Acum apelăm funcția proaspăt definită: >>> fib(2000) 0 1 1 2 3 5 8 13 21 34 55 89 144 233 377 610 987 1597

source: The keyword :keyword:`def` introduces a function *definition*. It must be followed by the function name and the parenthesized list of formal parameters. The statements that form the body of the function start at the next line, and must be indented.
ro: Cuvântul-cheie :keyword:`def` introduce *definiția* unei funcții. El trebuie urmat de numele funcției și de lista cuprinsă între paranteze a parametrilor formali ai funcției. Instrucțiunile care alcătuiesc corpul funcției vor începe de pe linia următoare, și vor trebui scrise ca alineate.

source: The first statement of the function body can optionally be a string literal; this string literal is the function's documentation string, or :dfn:`docstring`. (More about docstrings can be found in the section :ref:`tut-docstrings`.) There are tools which use docstrings to automatically produce online or printed documentation, or to let the user interactively browse through code; it's good practice to include docstrings in code that you write, so make a habit of it.
ro: Prima instrucțiune din corpul funcției poate fi o dată literală, opțională, sub forma unui șir de caractere; acest literal de tip șir de caractere este șirul de caractere al documentației funcției respective, așa-numitul :dfn:`docstring`. (Mai multe despre docstring-uri se pot afla în secțiunea :ref:`tut-docstrings`.) Există unelte informatice care folosesc docstring-urile pentru a produce în mod automat documentație, atât online cât și tipărită, ori pentru a-i permite utilizatorului să răsfoiască, interactiv, codul-sursă; este o bună practică să inserați docstring-uri în codul pe care îl construiți, așadar, făceți-vă un obicei din aceasta.

source: The *execution* of a function introduces a new symbol table used for the local variables of the function. More precisely, all variable assignments in a function store the value in the local symbol table; whereas variable references first look in the local symbol table, then in the local symbol tables of enclosing functions, then in the global symbol table, and finally in the table of built-in names. Thus, global variables and variables of enclosing functions cannot be directly assigned a value within a function (unless, for global variables, named in a :keyword:`global` statement, or, for variables of enclosing functions, named in a :keyword:`nonlocal` statement), although they may be referenced.
ro: La *execuția* unei funcții se construiește o nouă tabelă de simboluri ce va fi folosită pentru variabilele locale ale funcției. Mai precis, toate atribuirile făcute unor variabile în corpul unei funcții stochează valorile respective în tabela de simboluri locală; în ce le privește, referințele la variabile vor căuta mai întâi în tabela de simboluri locală, apoi în tabelele de simboluri locale ale funcțiilor în care este imbricată funcția, după care în tabela de simboluri globală și, în final, în tabela de nume predefinite. Astfel, nici variabilelor globale și nici variabilelor din funcțiile în care este imbricată funcția în cauză nu li se pot atribui în mod direct valori prin codul funcției (cu excepția, pentru variabilele globale, celor numite într-o instrucțiune :keyword:`global` ori, pentru variabilele din funcțiile în care este imbricată funcția, a celor numite într-o instrucțiune :keyword:`nonlocal`), chiar dacă pot exista referințe la ele.

source: The actual parameters (arguments) to a function call are introduced in the local symbol table of the called function when it is called; thus, arguments are passed using *call by value* (where the *value* is always an object *reference*, not the value of the object). [#]_ When a function calls another function, or calls itself recursively, a new local symbol table is created for that call.
ro: Parametrii actuali (argumentele) dintr-un apel de funcție sunt introduși în tabela de simboluri locală a funcției apelate la apelul acesteia; astfel, argumentele sunt *transmise prin valoare* (unde *valoarea* este întotdeauna *referința* la un obiect, niciodată valoarea obiectului). [#]_ Când o funcție apelează altă funcție, ori se apelează recursiv pe ea-însăși, o tabelă de simboluri locale nouă va fi creată la apel.

source: A function definition associates the function name with the function object in the current symbol table. The interpreter recognizes the object pointed to by that name as a user-defined function. Other names can also point to that same function object and can also be used to access the function::
ro: Definiția unei funcții asociază numele funcției cu obiectul-funcție în tabela de simboluri curentă. Interpretorul recunoaște obiectul către care țintește numele ca fiind o funcție definită-de-utilizator. Și alte nume pot ținti către același obiect-funcție și pot fi, de aceea, utilizate la accesarea funcției::

source: Coming from other languages, you might object that ``fib`` is not a function but a procedure since it doesn't return a value. In fact, even functions without a :keyword:`return` statement do return a value, albeit a rather boring one. This value is called ``None`` (it's a built-in name). Writing the value ``None`` is normally suppressed by the interpreter if it would be the only value written. You can see it if you really want to using :func:`print`::
ro: Dacă sunteți obișnuit cu alte limbaje de programare, atunci este posibil să considerați că ``fib`` nu poate fi funcție, ci procedură, deoarece ea nu returnează nicio valoare. În fapt, chiar și funcțiile care nu au nicio instrucțiune :keyword:`return` returnează o valoare, numai că valoarea respectivă nu înseamnă mai nimic. Această valoare se numește ``None`` (adică ``Nimic``, un nume predefinit). Afișarea valorii ``None`` este suprimată, în mod obișnuit, de către interpretor în cazul în care ea ar fi singura valoare afișată. O puteți vedea, dacă țineți neapărat, folosind :func:`print`::

source: It is simple to write a function that returns a list of the numbers of the Fibonacci series, instead of printing it::
ro: Este mai ușor să scrieți o funcție care returnează o listă de numere din șirul lui Fibonaci în loc de una care să afișeze aceste numere::

source: >>> def fib2(n): # return Fibonacci series up to n ... """Return a list containing the Fibonacci series up to n.""" ... result = [] ... a, b = 0, 1 ... while a < n: ... result.append(a) # see below ... a, b = b, a+b ... return result ... >>> f100 = fib2(100) # call it >>> f100 # write the result [0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
ro: >>> def fib2(n): # întoarce șirul lui Fibonacci de până la n ... """Întoarce o listă conținând termenii din șirul lui ... Fibonacci mai mici decât n.""" ... rezultat = [] ... a, b = 0, 1 ... while a < n: ... rezultat.append(a) # vezi mai jos ... a, b = b, a+b ... return rezultat ... >>> f100 = fib2(100) # apelul funcției >>> f100 # afișarea rezultatului [0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]

source: This example, as usual, demonstrates some new Python features:
ro: Acest exemplu, ca și până acum, probează câteva caracteristici noi ale Python-ului:

source: The :keyword:`return` statement returns with a value from a function. :keyword:`!return` without an expression argument returns ``None``. Falling off the end of a function also returns ``None``.
ro: Instrucțiunea :keyword:`return` întoarce o valoare a funcției. :keyword:`!return` neurmat de vreo expresie ca argument va întoarce ``None``. De asemeni, la terminarea corpului de instrucțiuni al unei funcții se întoarce ``None``.

source: The statement ``result.append(a)`` calls a *method* of the list object ``result``. A method is a function that 'belongs' to an object and is named ``obj.methodname``, where ``obj`` is some object (this may be an expression), and ``methodname`` is the name of a method that is defined by the object's type. Different types define different methods. Methods of different types may have the same name without causing ambiguity. (It is possible to define your own object types and methods, using *classes*, see :ref:`tut-classes`) The method :meth:`!append` shown in the example is defined for list objects; it adds a new element at the end of the list. In this example it is equivalent to ``result = result + [a]``, but more efficient.
ro: Intrucțiunea ``rezultat.append(a)`` apelează o *metodă* a obiectului listă ``rezultat``. Metoda este acea funcție care îi 'aparține' unui obiect și care poartă numele de ``obiect.nume_de_metodă``, în care ``obiect`` desemnează un obiect oarecare (poate fi inclusiv o expresie) iar ``nume_de_metodă`` este numele unei metode definite de către tipul obiectului. Unor tipuri diferite le corespund metode diferite. Metodele unor tipuri diferite pot avea același nume fără a da naștere la ambiguități. (Aveți posibilitatea să vă definiți propriile tipuri de obiecte și propriile metode, cu ajutorul *claselor*, vezi :ref:`tut-classes`.) Metoda :meth:`!append`, folosită în exemplu, se definește pentru obiectele listă; ea adaugă un element nou la sfârșitul listei. În exemplul de față, această adăugare este echivalentă cu ``rezultat = rezultat + [a]``, doar că se realizează mai eficient.

source: More on Defining Functions
ro: Mai multe despre definirea funcțiilor

source: It is also possible to define functions with a variable number of arguments. There are three forms, which can be combined.
ro: Este posibil să definim funcții care să aibă număr variabil de argumente. Aceasta poate fi realizată în trei feluri, care pot fi combinate.

source: Default Argument Values
ro: Valori implicite pentru argumente

source: The most useful form is to specify a default value for one or more arguments. This creates a function that can be called with fewer arguments than it is defined to allow. For example::
ro: Modalitatea cea mai utilă este să specificăm valori prestabilite pentru unul sau mai multe argumente. Se creează o funcție ce va putea fi apelată cu mai puține argumente decât au fost folosite la definirea ei. Cum ar fi::

source: def ask_ok(prompt, retries=4, reminder='Please try again!'): while True: reply = input(prompt) if reply in {'y', 'ye', 'yes'}: return True if reply in {'n', 'no', 'nop', 'nope'}: return False retries = retries - 1 if retries < 0: raise ValueError('invalid user response') print(reminder)
ro: def cere_permisiunea(promptul, încercări=4, \ atenționare='Încercați din nou, vă rog!'): while True: răspuns = input(promptul) if răspuns in {'d', 'mda', 'da'}: return True if răspuns in {'n', 'nu', 'nț', 'nici pomeneală'}: return False încercări = încercări - 1 if încercări < 0: raise ValueError('utilizatorul răspunde greșit') print(atenționare)

source: This function can be called in several ways:
ro: Această funcție poate fi apelată în mai multe moduri:

source: giving only the mandatory argument: ``ask_ok('Do you really want to quit?')``
ro: precizând numai argumentul obligatoriu: ``cere_permisiunea('Chiar vreți să ieșiți?')``

source: giving one of the optional arguments: ``ask_ok('OK to overwrite the file?', 2)``
ro: oferind și unul dintre argumentele opționale: ``cere_permisiunea('De acord cu suprascrierea fișierului?', 2)``

source: or even giving all arguments: ``ask_ok('OK to overwrite the file?', 2, 'Come on, only yes or no!')``
ro: ori introducând absolut toate argumentele: ``cere_permisiunea('De acord cu suprascrierea fișierului?', 2, 'Haideți, vă rog, numai da sau nu!')``

source: This example also introduces the :keyword:`in` keyword. This tests whether or not a sequence contains a certain value.
ro: Exemplul de față introduce și cuvântul-cheie :keyword:`in`. El verifică dacă o secvență conține sau nu o anumită valoare.

source: The default values are evaluated at the point of function definition in the *defining* scope, so that ::
ro: Valorile prestabilite sunt evaluate chiar acolo unde se definește funcția în domeniul de valabilitate (de la englezescul *scope*) al *definiției*, așa că::

source: will print ``5``.
ro: va afișa ``5``.

source: **Important warning:** The default value is evaluated only once. This makes a difference when the default is a mutable object such as a list, dictionary, or instances of most classes. For example, the following function accumulates the arguments passed to it on subsequent calls::
ro: **Avertizare importantă:** Valoarea prestabilită se evaluează o singură dată. Acest fapt contează atunci când valoarea prestabilită este un obiect mutabil, precum o listă, un dicționar ori instanțe ale majorității claselor. De exemplu, funcția următoare pune laolaltă argumentele transmise ei în apeluri succesive::

source: This will print ::
ro: Se va afișa ::

source: If you don't want the default to be shared between subsequent calls, you can write the function like this instead::
ro: Dacă nu doriți ca valoarea prestabilită să se păstreze între apeluri succesive, atunci puteți rescrie funcția după cum urmează::

source: Keyword Arguments
ro: Argumentele cuvânt-cheie

source: Functions can also be called using :term:`keyword arguments <keyword argument>` of the form ``kwarg=value``. For instance, the following function::
ro: Funcțiile mai pot fi apelate și folosind :term:`argumente cuvânt-cheie <keyword argument>` de forma ``arg_cvc=valoare``. De exemplu, funcția următoare, care face referire la un `scheci <https://en.wikipedia.org/wiki/Dead_Parrot_sketch>`_ Monty Python::

source: def parrot(voltage, state='a stiff', action='voom', type='Norwegian Blue'): print("-- This parrot wouldn't", action, end=' ') print("if you put", voltage, "volts through it.") print("-- Lovely plumage, the", type) print("-- It's", state, "!")
ro: def papagal(voltaj, stare='țeapăn', acțiune='fâl-fâl', \ tip='Albastrul de Norvegia'): print("-- Papagalul acesta n-are cum să", acțiune, end=' ') print("dacă băgați", voltaj, "de volți în el.") print("-- Ce mai penaj, ", tip) print("-- Doar că-i", stare, "!")

source: accepts one required argument (``voltage``) and three optional arguments (``state``, ``action``, and ``type``). This function can be called in any of the following ways::
ro: are un argument obligatoriu (``voltaj``) și trei argumente opționale (``stare``, ``acțiune`` și ``tip``). Funcția poate fi apelată în oricare din modurile care urmează::

source: parrot(1000) # 1 positional argument parrot(voltage=1000) # 1 keyword argument parrot(voltage=1000000, action='VOOOOOM') # 2 keyword arguments parrot(action='VOOOOOM', voltage=1000000) # 2 keyword arguments parrot('a million', 'bereft of life', 'jump') # 3 positional arguments parrot('a thousand', state='pushing up the daisies') # 1 positional, 1 keyword
ro: papagal(1000) # 1 argument pozițional papagal(voltaj=1000) # 1 argument cuvânt-cheie papagal(voltaj=1000000, acțiune='FÂÂÂL-FÂÂÂL') # 2 argumente cuvânt-cheie papagal(acțiune='FÂÂÂL-FÂÂÂL', voltaj=1000000) # 2 argumente cuvânt-cheie papagal('un milion', 'lipsit de viață', 'sară') # 3 argumente poziționale papagal('o mie', stare='pământ de flori') # 1 pozițional, 1 cuvânt-cheie

source: but all the following calls would be invalid::
ro: în schimb, următoarele apeluri vor fi invalidate::

source: parrot() # required argument missing parrot(voltage=5.0, 'dead') # non-keyword argument after a keyword argument parrot(110, voltage=220) # duplicate value for the same argument parrot(actor='John Cleese') # unknown keyword argument
ro: papagal() # lipsește argumentul obligatoriu papagal(voltaj=5.0, 'mort') # argument care nu e cuvânt-cheie # după un argument cuvânt-cheie papagal(110, voltaj=220) # valoare duplicată a unui argument papagal(actor='John Cleese') # argument cuvânt-cheie necunoscut
