Repository: python/python-docs-ro
Catalog: tutorial/controlflow.po
Languages: ro

source: More Control Flow Tools
ro: Mai multe unelte de control al fluxului

source: As well as the :keyword:`while` statement just introduced, Python uses a few more that we will encounter in this chapter.
ro: Pe lângă instrucțiunea de control :keyword:`while` introdusă anterior, Python-ul utilizează alte câteva asemenea instrucțiuni cu care ne vom întâlni în acest capitol.

source: :keyword:`!if` Statements
ro: Instrucțiuni :keyword:`!if`

source: Perhaps the most well-known statement type is the :keyword:`if` statement. For example::
ro: Probabil că cel mai cunoscut tip de instrucțiune de control este instrucțiunea :keyword:`if`. Ca, de exemplu::

source: >>> x = int(input("Please enter an integer: ")) Please enter an integer: 42 >>> if x < 0: ... x = 0 ... print('Negative changed to zero') ... elif x == 0: ... print('Zero') ... elif x == 1: ... print('Single') ... else: ... print('More') ... More
ro: >>> x = int(input("Vă rugăm să introduceți un număr întreg: ")) Vă rugăm să introduceți un număr întreg: 42 >>> if x < 0: ... x = 0 ... print('Număr negativ, pe care îl transformăm în zero') ... elif x == 0: ... print('Numărul zero') ... elif x == 1: ... print('Numărul unu') ... else: ... print('Număr mai mare ca unu') ... Număr mai mare ca unu

source: There can be zero or more :keyword:`elif` parts, and the :keyword:`else` part is optional. The keyword ':keyword:`!elif`' is short for 'else if', and is useful to avoid excessive indentation. An :keyword:`!if` ... :keyword:`!elif` ... :keyword:`!elif` ... sequence is a substitute for the ``switch`` or ``case`` statements found in other languages.
ro: Putem avea zero sau mai multe clauze :keyword:`elif`, în timp ce clauza :keyword:`else` este opțională. Cuvântul-cheie ':keyword:`!elif`' este prescurtarea lui 'else if' și ne permite să evităm indentarea excesivă. O secvență :keyword:`!if` ... :keyword:`!elif` ... :keyword:`!elif` ... servește de substitut pentru instrucțiuni precum ``switch`` sau ``case`` disponibile în alte limbaje de programare.

source: If you're comparing the same value to several constants, or checking for specific types or attributes, you may also find the :keyword:`!match` statement useful. For more details see :ref:`tut-match`.
ro: Dacă aveți de comparat o valoare cu mai multe constante, ori dacă verificați anumite tipuri de date sau atribute, s-ar putea să vă fie utilă instrucțiunea de control :keyword:`!match`. Pentru mai multe detalii, vedeți :ref:`tut-match`.

source: :keyword:`!for` Statements
ro: Instrucțiuni :keyword:`!for`

source: The :keyword:`for` statement in Python differs a bit from what you may be used to in C or Pascal. Rather than always iterating over an arithmetic progression of numbers (like in Pascal), or giving the user the ability to define both the iteration step and halting condition (as C), Python's :keyword:`!for` statement iterates over the items of any sequence (a list or a string), in the order that they appear in the sequence. For example (no pun intended):
ro: Instrucțiunea :keyword:`for` din Python diferă puțin de cele cu care poate că sunteți obișnuit din C ori din Pascal. În loc să itereze mereu după elementele numerice ale unei progresii aritmetice (precum în Pascal), ori să-i dea utilizatorului posibilitatea de a defini atât un pas de iterație cât și o condiție de oprire (ca în C), instrucțiunea :keyword:`!for` a Python-ului iterează după itemii oricărei secvențe (fie ea listă sau șir de caractere), în ordinea în care acești itemi apar în secvență. De exemplu (fără să facem vreun `joc de cuvinte <https://en.wikipedia.org/wiki/Pun>`_) :

source: >>> # Measure some strings: >>> words = ['cat', 'window', 'defenestrate'] >>> for w in words: ... print(w, len(w)) ... cat 3 window 6 defenestrate 12
ro: >>> # Să evaluăm câteva șiruri de caractere: >>> cuvinte = ['pisică', 'fereastră', 'defenestrare'] >>> for c in cuvinte: ... print(c, len(c)) ... pisică 6 fereastră 9 defenestrare 12

source: Code that modifies a collection while iterating over that same collection can be tricky to get right. Instead, it is usually more straight-forward to loop over a copy of the collection or to create a new collection::
ro: Codul care să modifice o colecție în timp ce iterează după itemii acelei colecții este greu de scris din prima încercare. În schimb, se dovedesc mai ușor de realizat atât o ciclare după itemii unei copii a colecției în cauză cât și crearea unei colecții noi::

source: # Create a sample collection users = {'Hans': 'active', 'Éléonore': 'inactive', '景太郎': 'active'} # Strategy: Iterate over a copy for user, status in users.copy().items(): if status == 'inactive': del users[user] # Strategy: Create a new collection active_users = {} for user, status in users.items(): if status == 'active': active_users[user] = status
ro: # Crearea unei colecții eșantion utilizatori = {'Hans': 'activ', 'Éléonore': 'inactiv', '景太郎': 'activ'} # Strategie: să iterăm după itemii unei copii for utilizatorul, starea in utilizatori.copy().items(): if starea == 'inactiv': del utilizatori[utilizatorul] # Strategie: să creăm o nouă colecție utilizatori_activi = {} for utilizatorul, starea in utilizatori.items(): if starea == 'activ': utilizatori_activi[utilizatorul] = starea

source: The :func:`range` Function
ro: Funcția :func:`range`

source: If you do need to iterate over a sequence of numbers, the built-in function :func:`range` comes in handy. It generates arithmetic progressions::
ro: Dacă aveți de iterat după termenii unui șir de numere, atunci funcția predefinită :func:`range` vă este la îndemână. Ea generează progresii aritmetice::

source: The given end point is never part of the generated sequence; ``range(10)`` generates 10 values, the legal indices for items of a sequence of length 10. It is possible to let the range start at another number, or to specify a different increment (even negative; sometimes this is called the 'step')::
ro: Valoarea de final precizată nu va face niciodată parte din secvența generată; ``range(10)`` generează 10 valori, mai precis indecșii permiși ai itemilor unei secvențe de lungime 10. Este posibil să începem plaja de valori și de la alt număr, ori să specificăm un increment diferit (inclusiv negativ; uneori, el este numit 'pasul')::

source: To iterate over the indices of a sequence, you can combine :func:`range` and :func:`len` as follows::
ro: Pentru a itera după indicii unei secvențe, puteți combina :func:`range` și :func:`len` după cum urmează. Exemplul face referire la un `cântec de grădiniță american <https://en.wikipedia.org/wiki/Mary_Had_a_Little_Lamb>`_::

source: >>> a = ['Mary', 'had', 'a', 'little', 'lamb'] >>> for i in range(len(a)): ... print(i, a[i]) ... 0 Mary 1 had 2 a 3 little 4 lamb
ro: >>> a = ['Maria', 'avea', 'un', 'mieluț'] >>> for i in range(len(a)): ... print(i, a[i]) ... 0 Maria 1 avea 2 un 3 mieluț

source: In most such cases, however, it is convenient to use the :func:`enumerate` function, see :ref:`tut-loopidioms`.
ro: Pe de altă parte, în majoritatea unor asemenea cazuri, este convenabil să utilizați funcția :func:`enumerate`, a se vedea :ref:`tut-loopidioms`.

source: A strange thing happens if you just print a range::
ro: Ceva neobișnuit se va petrece atunci când printați o plajă de valori de-a dreptul::

source: In many ways the object returned by :func:`range` behaves as if it is a list, but in fact it isn't. It is an object which returns the successive items of the desired sequence when you iterate over it, but it doesn't really make the list, thus saving space.
ro: În multe privințe, obiectul returnat de :func:`range` se comportă de parcă ar fi o listă, însă el nu este o listă. Este doar un obiect care întoarce itemii consecutivi ai secvenței care vă interesează atunci când iterați după itemii acesteia, însă el nu construiește cu adevărat o listă și prin aceasta economisește spațiu.

source: We say such an object is :term:`iterable`, that is, suitable as a target for functions and constructs that expect something from which they can obtain successive items until the supply is exhausted. We have seen that the :keyword:`for` statement is such a construct, while an example of a function that takes an iterable is :func:`sum`::
ro: Spunem despre un asemenea obiect că este :term:`iterable`, adică potrivit ca țintă pentru funcțiile și constructele care se așteaptă la ceva din care să extragă itemi succesivi până ce rezervorul acestor itemi se va goli. Am văzut deja că instrucțiunea :keyword:`for` este un asemenea construct, în timp ce o funcție care poate avea un iterabil drept argument este :func:`sum`::

source: Later we will see more functions that return iterables and take iterables as arguments. In chapter :ref:`tut-structures`, we will discuss in more detail about :func:`list`.
ro: Vom vedea ulterior și alte funcții care întorc iterabili și care primesc iterabili ca argumente. În capitolul :ref:`tut-structures` vom discuta mai în detaliu despre :func:`list`.

source: :keyword:`!break` and :keyword:`!continue` Statements
ro: Instrucțiunile :keyword:`!break` și :keyword:`!continue`

source: The :keyword:`break` statement breaks out of the innermost enclosing :keyword:`for` or :keyword:`while` loop::
ro: Instrucțiunea :keyword:`break` stopează cea mai din interior instrucțiune de ciclare :keyword:`for` sau :keyword:`while` care o include::

source: >>> for n in range(2, 10): ... for x in range(2, n): ... if n % x == 0: ... print(f"{n} equals {x} * {n//x}") ... break ... 4 equals 2 * 2 6 equals 2 * 3 8 equals 2 * 4 9 equals 3 * 3
ro: >>> for n in range(2, 10): ... for x in range(2, n): ... if n % x == 0: ... print(f"{n} este egal cu {x} * {n//x}") ... break ... 4 este egal cu 2 * 2 6 este egal cu 2 * 3 8 este egal cu 2 * 4 9 este egal cu 3 * 3

source: The :keyword:`continue` statement continues with the next iteration of the loop::
ro: Instrucțiunea :keyword:`continue` trece la următoarea iterație a ciclului::

source: >>> for num in range(2, 10): ... if num % 2 == 0: ... print(f"Found an even number {num}") ... continue ... print(f"Found an odd number {num}") ... Found an even number 2 Found an odd number 3 Found an even number 4 Found an odd number 5 Found an even number 6 Found an odd number 7 Found an even number 8 Found an odd number 9
ro: >>> for num in range(2, 10): ... if num % 2 == 0: ... print(f"Găsit un număr par {num}") ... continue ... print(f"Găsit un număr impar {num}") ... Găsit un număr par 2 Găsit un număr impar 3 Găsit un număr par 4 Găsit un număr impar 5 Găsit un număr par 6 Găsit un număr impar 7 Găsit un număr par 8 Găsit un număr impar 9

source: :keyword:`!else` Clauses on Loops
ro: Clauzele :keyword:`!else` ale ciclurilor

source: In a :keyword:`!for` or :keyword:`!while` loop the :keyword:`!break` statement may be paired with an :keyword:`!else` clause. If the loop finishes without executing the :keyword:`!break`, the :keyword:`!else` clause executes.
ro: Într-un ciclu :keyword:`!for` sau :keyword:`!while`, instrucțiunea :keyword:`!break` poate fi utilizată în tandem cu clauza :keyword:`!else`. Astfel, dacă ciclul se încheie fără să fi fost executat :keyword:`!break`-ul, atunci va fi executată clauza :keyword:`!else`.

source: In a :keyword:`for` loop, the :keyword:`!else` clause is executed after the loop finishes its final iteration, that is, if no break occurred.
ro: Într-un ciclu :keyword:`for`, clauza :keyword:`!else` se execută după ce bucla își încheie iterația finală, adică dacă nu a intervenit nicio stopare pe parcurs.

source: In a :keyword:`while` loop, it's executed after the loop's condition becomes false.
ro: Într-un ciclu :keyword:`while`, clauza se va executa după ce condiția buclei va deveni falsă.

source: In either kind of loop, the :keyword:`!else` clause is **not** executed if the loop was terminated by a :keyword:`break`. Of course, other ways of ending the loop early, such as a :keyword:`return` or a raised exception, will also skip execution of the :keyword:`else` clause.
ro: Pentru ambele tipuri de ciclare, clauza :keyword:`!else` **nu** se va executa dacă ciclul în cauză s-a terminat cu un :keyword:`break`. Desigur, și alte cazuri de oprire timpurie a ciclării, precum un :keyword:`return` sau lansarea (de la englezescul *to raise*) unei excepții, vor anula execuția clauzei :keyword:`else`.

source: This is exemplified in the following :keyword:`!for` loop, which searches for prime numbers::
ro: Toate acestea se exemplifică în următorul ciclu :keyword:`!for`, cu care căutăm numere prime::

source: >>> for n in range(2, 10): ... for x in range(2, n): ... if n % x == 0: ... print(n, 'equals', x, '*', n//x) ... break ... else: ... # loop fell through without finding a factor ... print(n, 'is a prime number') ... 2 is a prime number 3 is a prime number 4 equals 2 * 2 5 is a prime number 6 equals 2 * 3 7 is a prime number 8 equals 2 * 4 9 equals 3 * 3
ro: >>> for n in range(2, 10): ... for x in range(2, n): ... if n % x == 0: ... print(n, 'este egal cu', x, '*', n//x) ... break ... else: ... # cade până aici fără să fi găsit vreun divizor ... print(n, 'este număr prim') ... 2 este număr prim 3 este număr prim 4 este egal cu 2 * 2 5 este număr prim 6 este egal cu 2 * 3 7 este număr prim 8 este egal cu 2 * 4 9 este egal cu 3 * 3

source: (Yes, this is the correct code. Look closely: the ``else`` clause belongs to the ``for`` loop, **not** the ``if`` statement.)
ro: (Da, acesta este codul corect. Uitați-vă îndeaproape: clauza ``else`` ține de bucla ``for`` și **nu** de instrucțiunea ``if``.)

source: One way to think of the else clause is to imagine it paired with the ``if`` inside the loop. As the loop executes, it will run a sequence like if/if/if/else. The ``if`` is inside the loop, encountered a number of times. If the condition is ever true, a ``break`` will happen. If the condition is never true, the ``else`` clause outside the loop will execute.
ro: Este bine, atunci când vă gândiți la clauza else, să o socotiți ca făcând pereche cu ``if``-ul din buclă. Pe măsură ce bucla este executată, ea va rula o secvență de tipul if/if/if/else. Acest ``if`` este în interiorul buclei și va fi întâlnit de un număr oarecare de ori. Dacă condiția asociată lui va avea valoarea logică adevărat la un moment dat, atunci se va produce un ``break``. În schimb, dacă valoarea logică a condiției nu va fi niciodată adevărat, atunci se va executa clauza ``else`` din afara buclei.

source: When used with a loop, the ``else`` clause has more in common with the ``else`` clause of a :keyword:`try` statement than it does with that of ``if`` statements: a ``try`` statement's ``else`` clause runs when no exception occurs, and a loop's ``else`` clause runs when no ``break`` occurs. For more on the ``try`` statement and exceptions, see :ref:`tut-handling`.
ro: Atunci când este folosită cu o instrucțiune de ciclare, clauza ``else`` seamănă mai degrabă cu clauza ``else`` a unei instrucțiuni :keyword:`try` decât cu cea a unor instrucțiuni ``if``: clauza ``else`` a unei instrucțiuni ``try`` va rula numai atunci când nu survine nicio excepție, pe când clauza ``else`` a unei bucle va rula atunci când nu intervine niciun ``break``. Pentru detalii privind instrucțiunea ``try`` și excepțiile, vedeți :ref:`tut-handling`.

source: :keyword:`!pass` Statements
ro: Instrucțiuni :keyword:`!pass`

source: The :keyword:`pass` statement does nothing. It can be used when a statement is required syntactically but the program requires no action. For example::
ro: Instrucțiunea :keyword:`pass` nu realizează nimic. Ea poate fi folosită atunci când sintaxa limbajului cere introducerea unei instrucțiuni dar programul propriu-zis nu are nimic de executat. De exemplu::

source: >>> while True: ... pass # Busy-wait for keyboard interrupt (Ctrl+C) ...
ro: >>> while True: ... pass # Ocupat-se așteaptă o întrerupere de la tastatură (Ctrl+C) ...

source: This is commonly used for creating minimal classes::
ro: Se folosește în mod uzual la crearea unor clase minimale::

source: >>> class MyEmptyClass: ... pass ...
ro: >>> class ClasaMeaVidă: ... pass ...

source: Another place :keyword:`pass` can be used is as a place-holder for a function or conditional body when you are working on new code, allowing you to keep thinking at a more abstract level. The :keyword:`!pass` is silently ignored::
ro: Altă întrebuințare pentru :keyword:`pass` este ca înlocuitor al corpului unei funcții sau al celui al unei instrucțiuni de selecție atunci când lucrați la un program nou, permițându-vă să gândiți programul la nivel abstract. Instrucțiunea :keyword:`!pass` este ignorată în mod silențios::

source: >>> def initlog(*args): ... pass # Remember to implement this! ...
ro: >>> def initlog(*args): ... pass # Nu uitați să o implementați! ...

source: :keyword:`!match` Statements
ro: Instrucțiuni :keyword:`!match`

source: A :keyword:`match` statement takes an expression and compares its value to successive patterns given as one or more case blocks. This is superficially similar to a switch statement in C, Java or JavaScript (and many other languages), but it's more similar to pattern matching in languages like Rust or Haskell. Only the first pattern that matches gets executed and it can also extract components (sequence elements or object attributes) from the value into variables.
ro: O instrucțiune :keyword:`match` preia o expresie și îi compară valoarea cu modelele date de blocuri case de cod succesive. Aceasta o face să semene, la prima vedere, cu o instrucțiune switch din C, Java sau JavaScript (și din multe alte limbaje), doar că ea este mai degrabă similară cu potrivirea după model (de la englezescul *pattern matching*) din limbaje precum Rust ori Haskell. Va fi executat numai primul model care se potrivește și tot atunci vor putea fi salvate în variabile diverse componente (cum ar fi itemi de secvență ori atribute de obiect) ale valorii expresiei.

source: The simplest form compares a subject value against one or more literals::
ro: În cea mai simplă formă, ea compară valoarea unei mărimi cu valorile uneia sau mai multor date literale. În exemplul care urmează este introdus un cod de răspuns HTTP (418) folosit ca `păcăleală de întâi aprilie <https://developer.mozilla.org/en-US/docs/Web/HTTP/Reference/Status/418>`_::

source: def http_error(status): match status: case 400: return "Bad request" case 404: return "Not found" case 418: return "I'm a teapot" case _: return "Something's wrong with the internet"
ro: def http_error(stare): match stare: case 400: return "Cerere incorectă" case 404: return "Nu a fost găsită" case 418: return "Eu sunt un ceainic" case _: return "S-a întâmplat ceva cu conexiunea internet"

source: Note the last block: the "variable name" ``_`` acts as a *wildcard* and never fails to match. If no case matches, none of the branches is executed.
ro: Observați ultimul bloc: "numele de variabilă" ``_`` acționează ca un *caracter de înlocuire* (de la englezescul *wildcard*) care se va potrivi cu toate valorile. Dacă niciunul dintre case-uri nu se potrivește, niciuna din ramurile de cod nu se va executa.

source: You can combine several literals in a single pattern using ``|`` ("or")::
ro: Puteți combina mai mulți literali într-un singur model folosind ``|`` ("sau")::

source: case 401 | 403 | 404: return "Not allowed"
ro: case 401 | 403 | 404: return "Nepermis"

source: Patterns can look like unpacking assignments, and can be used to bind variables::
ro: Modelele pot semăna cu atribuirile cu despachetare (de la englezescul *unpacking assignment*), putând fi folosite la legarea variabilelor::

source: # point is an (x, y) tuple match point: case (0, 0): print("Origin") case (0, y): print(f"Y={y}") case (x, 0): print(f"X={x}") case (x, y): print(f"X={x}, Y={y}") case _: raise ValueError("Not a point")
ro: # punctul este un tuplu (x, y) match punctul: case (0, 0): print("Originea") case (0, y): print(f"Y={y}") case (x, 0): print(f"X={x}") case (x, y): print(f"X={x}, Y={y}") case _: raise ValueError("Nu este punct")

source: Study that one carefully! The first pattern has two literals, and can be thought of as an extension of the literal pattern shown above. But the next two patterns combine a literal and a variable, and the variable *binds* a value from the subject (``point``). The fourth pattern captures two values, which makes it conceptually similar to the unpacking assignment ``(x, y) = point``.
ro: Studiați exemplul cu atenție! Primul model are doi literali, și poate fi considerat ca o extensie a modelului literal prezentat înainte. Următoarele două modele, în schimb, combină o dată literală cu o variabilă, iar de variabilă se *leagă* o valoare din mărime (``punctul``). Cel de-al patrulea model captează două valori, ceea ce îl face conceptual echivalent atribuirii cu despachetare ``(x, y) = punctul``.

source: If you are using classes to structure your data you can use the class name followed by an argument list resembling a constructor, but with the ability to capture attributes into variables::
ro: Dacă folosiți clase pentru a vă structura datele în program, atunci veți putea utiliza numele clasei urmat de o listă de argumente asemănătoare celei a unui constructor, doar că având proprietatea de a salva atribute în variabile::

source: class Point: def __init__(self, x, y): self.x = x self.y = y def where_is(point): match point: case Point(x=0, y=0): print("Origin") case Point(x=0, y=y): print(f"Y={y}") case Point(x=x, y=0): print(f"X={x}") case Point(): print("Somewhere else") case _: print("Not a point")
ro: class Punctul: def __init__(self, x, y): self.x = x self.y = y def unde_este(punctul): match punctul: case Punctul(x=0, y=0): print("Originea") case Punctul(x=0, y=y): print(f"Y={y}") case Punctul(x=x, y=0): print(f"X={x}") case Punctul(): print("Altundeva") case _: print("Nu e punct")

source: You can use positional parameters with some builtin classes that provide an ordering for their attributes (e.g. dataclasses). You can also define a specific position for attributes in patterns by setting the ``__match_args__`` special attribute in your classes. If it's set to ("x", "y"), the following patterns are all equivalent (and all bind the ``y`` attribute to the ``var`` variable)::
ro: Puteți utiliza argumente poziționale la unele din clasele predefinite, cele care oferă o ordonare a atributelor lor (precum clasele-de-date). De asemenea, puteți defini poziții specifice pentru atributele din modele prin setarea atributului special ``__match_args__`` pentru clasele dumneavoastră. Dacă acesta este setat la ("x", "y"), atunci următoarele modele sunt cu toatele echivalente (și toate leagă atributul ``y`` de variabila ``var``)::

source: Point(1, var) Point(1, y=var) Point(x=1, y=var) Point(y=var, x=1)
ro: Punctul(1, var) Punctul(1, y=var) Punctul(x=1, y=var) Punctul(y=var, x=1)
