Repository: python/python-docs-ro
Catalog: about.po
Languages: ro

source: About this documentation
ro: Despre această documentație

source: Python's documentation is generated from `reStructuredText`_ sources using `Sphinx`_, a documentation generator originally created for Python and now maintained as an independent project.
ro: Documentația Python este generată din fișiere sursă `reStructuredText`_ folosind `Sphinx`_, un generator de documentații creat special pentru Python și a cărui mentenanță se face, în prezent, ca proiect de sine stătător.

source: Development of the documentation and its toolchain is an entirely volunteer effort, just like Python itself. If you want to contribute, please take a look at the :ref:`reporting-bugs` page for information on how to do so. New volunteers are always welcome!
ro: Dezvoltarea documentației și a setului său de unelte este în totalitate o activitate de voluntariat, la fel ca dezvoltarea Python-ului. Dacă doriți să contribuiți, atunci vă rugăm să aruncați o privire la pagina :ref:`reporting-bugs` pentru a vă informa despre cum să procedați. Noii voluntari sunt oricând bineveniți!

source: Many thanks go to:
ro: Mulțumirile noastre merg către:

source: Fred L. Drake, Jr., the creator of the original Python documentation toolset and author of much of the content;
ro: Fred L. Drake, Jr., creatorul setului original de unelte al documentației Python precum și autorul unei mari părți din conținut;

source: the `Docutils <https://docutils.sourceforge.io/>`_ project for creating reStructuredText and the Docutils suite;
ro: echipa proiectului `Docutils <https://docutils.sourceforge.io>`_ pentru crearea lui reStructuredText și a suitei Docutils;

source: Fredrik Lundh for his Alternative Python Reference project from which Sphinx got many good ideas.
ro: Fredrik Lundh pentru proiectul său Alternativa Referinței Python de la care Sphinx-ul a primit multe idei bune.

source: Contributors to the Python documentation
ro: Contributorii la documentația Python

source: Many people have contributed to the Python language, the Python standard library, and the Python documentation. See :source:`Misc/ACKS` in the Python source distribution for a partial list of contributors.
ro: Multă lume a contribuit la limbajul Python, la biblioteca Python standard și la documentația Python. Găsiți în fișierul :source:`Misc/ACKS`, din distribuția codului sursă Python, o listă incompletă a contributorilor.

source: It is only with the input and contributions of the Python community that Python has such wonderful documentation -- Thank You!
ro: Numai prin implicarea și contribuțiile comunității Python a căpătat Python-ul o atât de minunată documentație -- Vă mulțumim tuturor!
