Repository: python/python-docs-ro
Catalog: bugs.po
Languages: ro

source: Dealing with Bugs
ro: Privind erorile

source: Python is a mature programming language which has established a reputation for stability. In order to maintain this reputation, the developers would like to know of any deficiencies you find in Python.
ro: Python-ul este un limbaj de programare matur care se bucură de reputația de a fi stabil. Pentru a păstra această reputație, dezvoltatorii doresc să afle ce deficiențe i-ați găsit Python-ului.

source: It can be sometimes faster to fix bugs yourself and contribute patches to Python as it streamlines the process and involves less people. Learn how to :ref:`contribute <contributing-to-python>`.
ro: Uneori poate fi mai rapid dacă rezolvați chiar dumneavoastră erorile și contribuiți cu adăugări la codul Python deoarece aceasta simplifică procedurile și implică mai puține persoane. Aflați cum să :ref:`contribuiți <contributing-to-python>`.

source: Documentation bugs
ro: Erori de documentație

source: If you find a bug in this documentation or would like to propose an improvement, please submit a bug report on the :ref:`tracker <using-the-tracker>`. If you have a suggestion on how to fix it, include that as well.
ro: Dacă găsiți o eroare în această documentație și/sau doriți să propuneți o îmbunătățire, vă rugăm să transmiteți un raport de eroare la :ref:`urmăritor <using-the-tracker>`. Dacă aveți o sugestie despre cum să o rezolvăm, includeți-o în raport.

source: You can also open a discussion item on our `Documentation Discourse forum <https://discuss.python.org/c/documentation/26>`_.
ro: Puteți, de asemeni, introduce un început de discuție pe forumul nostru `Discursul documentației <https://discuss.python.org/c/documentation/26>`_.

source: If you find a bug in the theme (HTML / CSS / JavaScript) of the documentation, please submit a bug report on the `python-doc-theme bug tracker <https://github.com/python/python-docs-theme>`_.
ro: Dacă găsiți o eroare în tema documentației (HTML / CSS / JavaScript), vă rugăm să transmiteți un raport de eroare la `urmăritorul de erori de la python-doc-theme <https://github.com/python/python-docs-theme>`_.

source: If you're short on time, you can also email documentation bug reports to docs@python.org (behavioral bugs can be sent to python-list@python.org). 'docs@' is a mailing list run by volunteers; your request will be noticed, though it may take a while to be processed.
ro: Dacă nu aveți mai mult timp la dispoziție, puteți trimite rapoartele de eroare privind documentația și la docs@python.org (erorile de funcționare pot fi trimise la python-list@python.org). 'docs@' este o listă de discuții îngrijită de voluntari; cererea dumneavoastră va fi remarcată de îndată, însă procesarea ei vă necesita un anume timp.

source: `Documentation bugs`_
ro: `Erori de documentație`_

source: A list of documentation bugs that have been submitted to the Python issue tracker.
ro: O listă a erorilor de documentație care au fost transmise urmăritorului de probleme ale Python-ului.

source: `Issue Tracking <https://devguide.python.org/tracker/>`_
ro: `Urmăritorul de probleme <https://devguide.python.org/tracker/>`_

source: Overview of the process involved in reporting an improvement on the tracker.
ro: O sinteză a procesului privind raportarea unei îmbunătățiri la urmăritor.

source: `Helping with Documentation <https://devguide.python.org/docquality/#helping-with-documentation>`_
ro: `Ajutor la documentație <https://devguide.python.org/docquality/#helping-with-documentation>`_

source: Comprehensive guide for individuals that are interested in contributing to Python documentation.
ro: Ghid comprehensiv pentru persoanele interesate să contribuie la documentația Python.

source: `Documentation Translations <https://devguide.python.org/documentation/translating/>`_
ro: `Traduceri ale documentației <https://devguide.python.org/documentation/translating/>`_

source: A list of GitHub pages for documentation translation and their primary contacts.
ro: O listă de pagini GitHub pentru traducerea documentației și persoanele de contact ale acestora.

source: Using the Python issue tracker
ro: Cum folosim urmăritorul de probleme al Python-ului

source: Issue reports for Python itself should be submitted via the GitHub issues tracker (https://github.com/python/cpython/issues). The GitHub issues tracker offers a web form which allows pertinent information to be entered and submitted to the developers.
ro: Rapoartele de eroare privitoare la codul Python propriu-zis trebuie transmise via urmăritorul de probleme disponibil pe GitHub (https://github.com/python/cpython/issues). Urmăritorul de probleme de pe GitHub deține un formular cu interfață web care permite ca informațiile pertinente să poată fi introduse și trimise de către dezvoltatori.

source: The first step in filing a report is to determine whether the problem has already been reported. The advantage in doing so, aside from saving the developers' time, is that you learn what has been done to fix it; it may be that the problem has already been fixed for the next release, or additional information is needed (in which case you are welcome to provide it if you can!). To do this, search the tracker using the search box at the top of the page.
ro: Primul pas în completarea unui raport constă în a stabili dacă problema întâlnită a fost deja raportată. Avantajul acestei acțiuni, dincolo de faptul că economisește timpul dezvoltatorilor, este că vă permite să aflați ceea ce s-a făcut pentru a rezolva problema; se poate întâmpla ca problema să fie deja rezolvată de către versiunea următoare, sau poate că problema necesită informații suplimentare (caz în care sunteți binevenit să le oferiți dacă ele vă sunt la îndemână!). Pentru aceasta, căutați în urmăritor folosind caseta de căutare din susul paginii.

source: If the problem you're reporting is not already in the list, log in to GitHub. If you don't already have a GitHub account, create a new account using the "Sign up" link. It is not possible to submit a bug report anonymously.
ro: Dacă problema pe care o raportați nu se găsește încă în listă, logați-vă la GitHub. Dacă nu aveți deja un cont GitHub, creați-vă un cont nou folosind linkul "Sign up". Nu este posibil să trimiteți un raport de eroare ca anonim.

source: Being now logged in, you can submit an issue. Click on the "New issue" button in the top bar to report a new issue.
ro: Fiind logat acum, puteți transmite o problemă. Apăsați pe butonul "New issue" din bara de sus pentru a raporta o problemă nouă.

source: The submission form has two fields, "Title" and "Comment".
ro: Formularul de submitere are două câmpuri, "Title" și "Comment".

source: For the "Title" field, enter a *very* short description of the problem; fewer than ten words is good.
ro: La câmpul "Title" ("Titlul"), introduceți o *foarte* scurtă descriere a problemei; este bine ca ea să fie de sub zece cuvinte.

source: In the "Comment" field, describe the problem in detail, including what you expected to happen and what did happen. Be sure to include whether any extension modules were involved, and what hardware and software platform you were using (including version information as appropriate).
ro: La câmpul "Comment" ("Comentariu"), descrieți problema în detaliu, incluzând ceea ce v-ați fi așteptat să se întâmple și ceea ce s-a întâmplat. Asigurați-vă că ați precizat dacă au fost folosite module de extindere, precum și ce platformă hardware și software ați folosit (incluzând, dacă este cazul, informații despre versiuni).

source: Each issue report will be reviewed by a developer who will determine what needs to be done to correct the problem. You will receive an update each time an action is taken on the issue.
ro: Fiecare raport de eroare va fi recenzat de către un dezvoltator care va stabili ce trebuie făcut pentru corectarea problemei. Veți primi o actualizare de fiecare dată când va fi întreprinsă o acțiune în această privință.

source: `How to Report Bugs Effectively <https://www.chiark.greenend.org.uk/~sgtatham/bugs.html>`_
ro: `Cum să raportezi erori în mod eficient <https://www.chiark.greenend.org.uk/~sgtatham/bugs.html>`_

source: Article which goes into some detail about how to create a useful bug report. This describes what kind of information is useful and why it is useful.
ro: Un articol care intră în detalii privind crearea unui raport de eroare util. Acesta descrie ce tip de informație este folositoare și de ce este folositoare.

source: `Bug Writing Guidelines <https://bugzilla.mozilla.org/page.cgi?id=bug-writing.html>`_
ro: `Recomandări pentru cum se scrie despre erori <https://bugzilla.mozilla.org/page.cgi?id=bug-writing.html>`_

source: Information about writing a good bug report. Some of this is specific to the Mozilla project, but describes general good practices.
ro: Informații despre cum se scrie un raport de eroare bun. Deși unele chestiuni îi sunt specifice proiectului Mozilla, se descriu practici bune general valabile.

source: Getting started contributing to Python yourself
ro: Începând să contribuiți la Python dumneavoastră înșivă

source: Beyond just reporting bugs that you find, you are also welcome to submit patches to fix them. You can find more information on how to get started patching Python in the `Python Developer's Guide`_. If you have questions, the `core-mentorship mailing list`_ is a friendly place to get answers to any and all questions pertaining to the process of fixing issues in Python.
ro: În afară de a raporta erorile pe care le-ați găsit, sunteți binevenit și să submiteți adăugări de cod pentru repararea lor. Puteți găsi mai multe informații despre cum să începeți să adăugați corecturi la Python în `Python Developer's Guide`_. Dacă aveți întrebări, `core-mentorship mailing list`_ este un loc propice pentru aflarea răspunsurilor la orice fel de întrebare privitoare la procesul reparării erorilor din Python.
